// программирования — метод, на вход получает некие аргументы (входные
// аргументы функции), а на выходе выдаёт какой-то результат. 
// случае она может и не возвращать его, тогда в некоторых языках такие конструкции
// называются процедурами. В языке С# не принято разделение на функции и процедуры, а
// просто говорится метод

// функцию как часть программного кода, которая описывается самим
// разработчиком

// ВозвращаемыйТипДанных ИмяМетода([ТипДанных1 ИмяАргумента1, ... ])
// {
//  Тело Метода
//  return ЗначениеСоответствующееВозвращаемомуТипуДанных;
// }

// ТИП ДАННЫХ[] ИМЯ = {Значение1,Значение2, ...}
// int[] array = { 9, 28, 1, 32, 1990 }
// int[] array = { 0, 0, 0, 0, 0 }
// int[] array = new int[5];
// int[] array = new int[]{ 0, 0, 0, 0, 0 }
// int[] array = new int[5]{ 1, 0, 2, 0, 3 }


// double f(double x)
// {
// double result = x*x+1;
// result result

///По-другому эти функции или методы называются подпрограммами.
///
// ///Функция также имеет входные аргументы и технически может возвращать значение. В общем

// int max (int arg1,int arg2,int arg3)
// {
// int result = arg1;
// if(arg2>result) result = arg2;
// if(arg3>result) result = arg3;
// return result;
// }





